app/controllers/api/annotations_controller.rb

    def create
        # debugger
        @annotation = Annotation.new(annotation_params)
        @annotation.user_id = current_user.id
        if @annotation.save
---
INSERT INTO "annotations" ("description", "joke_id", "user_id", "start_index", "end_index", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["description", "howdy"], ["joke_id", 95], ["user_id", 14], ["start_index", 594], ["end_index", 614], ["created_at", "2020-04-12 21:03:10.209453"], ["updated_at", "2020-04-12 21:03:10.209453"]]

    def update
        @annotation = Annotation.find(params[:id])
        if @annotation.update
            @joke = Joke.find(@annotation.joke_id)
---
SELECT  "jokes".* FROM "jokes" WHERE "jokes"."id" = $1 LIMIT $2  [["id", 95], ["LIMIT", 1]]