app/controllers/api/jokes_controller.rb

SELECT "jokes".* FROM "jokes"
---
    def index
        @jokes = Joke.all

SELECT  "jokes".* FROM "jokes" WHERE "jokes"."id" = $1 LIMIT $2  [["id", 95], ["LIMIT", 1]]
---
    def show
        @joke = Joke.find(params[:id])

SELECT  "comedians".* FROM "comedians" WHERE "comedians"."name" = $1 LIMIT $2  [["name", "Ellen DeGeneres"], ["LIMIT", 1]]
INSERT INTO "jokes" ("title", "comedian_id", "joke", "user_id", "created_at", "updated_at", "image") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @joke = Joke.new(joke_params)
        @joke.user_id = current_user.id
        @joke.comedian_id = Comedian.find_by(name: params[:joke][:comedian]).id
        if @joke.save