app/controllers/api/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Connor"], ["LIMIT", 1]]
---
    def create
        @user = User.find_by_credentials(params[:user][:username], params[:user][:password])
        if @user
            login!(@user)
            render 'api/users/show'
        else
            if params[:user][:username] == '' && params[:user][:password] = ''
                render json: ['You did not provide any details for authentication.'], status: 401
            elsif params[:user][:username] == ''
                render json: ['Login cannot be blank']
            elsif params[:user][:password] == ''
                render json: ['Password cannot be blank']
            elsif User.find_by(username: params[:user][:username])