app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "2t4zCD99JtJDwG4E3FKVDQ"], ["updated_at", "2020-04-06 18:19:40.978525"], ["id", 2]]
---
    def create
        @user = User.new(user_params)
        if @user.save
            login!(@user)
            render :show
        else
            errors = []
            @user.errors.full_messages.each do |error|
                if (error == 'Username has already been taken')
                    errors.push('That nickname is taken!')