app/views/api/jokes/_joke.json.jbuilder

SELECT "annotations".* FROM "annotations" WHERE "annotations"."joke_id" = $1  [["joke_id", 93]]
---
   json.annotations do
        json.array! joke.annotations.each do |annotation|